# CreateIntegerOfType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateIntegerOfType Method
IFCData Class See Also
---
Creates an integer data object of the specified type.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateIntegerOfType(
	int value,
	string typeName
)
```

Visual Basic
---
```text
Public Shared Function CreateIntegerOfType ( _
	value As Integer, _
	typeName As String _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateIntegerOfType(
	int value,
	String^ typeName
)
```

# ### Parameters
value
    Type: System..::..Int32 The integer value.
typeName
    Type: System..::..String The type name.
# ### Return Value
The IFCData object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace